ERP/app/Http/Controllers/HierarchyController.php

select * from `hierarchies` where `child` is null
select exists(select * from `hierarchies` where `child` is null) as `exists`
---
    public function index()
    {
        if (\Auth::user()->can('manage company settings')) {

            $hierarchies = Hierarchy::whereNull('child')->get();

        // dd($hierarchies);

            foreach ($hierarchies as $hierarchy) {
                $hierarchy->structure = json_decode($hierarchy->structure, true); // Decode JSON to PHP array
            }
            $hasIncompleteHierarchy = Hierarchy::whereNull('child')->exists();