ERP/app/Http/Controllers/InvoiceController.php

select * from `product_services` where `id` = '1' limit 1
---
    public function product(Request $request)
    {

        $data['product']     = $product = ProductService::where('id',$request->product_id)->with('unit')->first();

select * from `credit_notes` where `credit_notes`.`invoice` in (1)
select * from `invoices` where `invoices`.`id` = 1 limit 1
select * from `invoice_payments` where `invoice_id` = 1 limit 1
select * from `custom_fields` where `created_by` = 1 and `module` = 'invoice'
---
    public function show($ids)
    {

        if(\Auth::user()->can('show invoice'))
        {
            try {
                $id       = Crypt::decrypt($ids);
            } catch (\Throwable $th) {
                return redirect()->back()->with('error', __('Invoice Not Found.'));
            }
            $id      = Crypt::decrypt($ids);
            $invoice = Invoice::with(['creditNote','payments.bankAccount','items.product.unit'])->find($id);

            if(!empty($invoice->created_by) == \Auth::user()->creatorId())
            {
                $invoicePayment = InvoicePayment::where('invoice_id', $invoice->id)->first();

                $customer             = $invoice->customer;
                $iteams               = $invoice->items;
                $user                 = \Auth::user();
                $invoice->customField = CustomField::getData($invoice, 'invoice');
                $customFields         = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'invoice')->get();